# ChineseHongKongDollar Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..ChineseHongKongDollar Property
SymbolTypeId Class See Also
---
Symbol HK$, indicating unit Currency.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId ChineseHongKongDollar { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ChineseHongKongDollar As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ChineseHongKongDollar {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace